<html>
<head><TITLE>Porque codigos</TITLE>
</head>

<body>
<center>
<h3>
[<a href="indice.htm">Indice</a>]
</h3>
</center>
<hr>

<h2>&#191;Por qu&eacute; hay que usar c&oacute;digos?</h2>

Existen diversos sistemas operativos dentro del mundo de los ordenadores. Estos sistemas no son otra cosa que unos programas especiales que se ejecutan inmediatamente despu&eacute;s de encender el ordenador, y son los que se encargan de darle &quot;vida&quot; a nuestra m&aacute;quina.
<P>
Junto con estos programas, los ordenadores cargan en memoria unas tablas especiales que coinciden con los caracteres que tiene tu teclado y algunos m&aacute;s que no est&aacute;n en el mismo, pero que se pueden escribir en pantalla por otros medios. Estas tablas, desafortunadamente, no son siempre las mismas, y var&iacute;an de un sistema a otro, de una marca de ordenador a otra, de un modelo de teclado a otro, y por supuesto, de un idioma a otro. Por ejemplo, no se ven igual las letras con acentos desde un PC que desde un MACintosh, o una terminal UNIX, si las escribimos directamente desde el teclado.
<p>
Dado que el HTML pretende ser un lenguaje universal, y que una p&aacute;gina debe verse como su creador desea, sin importar si estamos ante un ordenador que &quot;habla&quot; en ingl&eacute;s o en espa&ntilde;ol, o que tiene tal o cual sistema operativo, se ha creado una tabla de caracteres &quot;conflictivos&quot; (en realidad est&aacute;n todos, pero generalmente s&oacute;lo se usa para caracteres especiales) que se escriben con un c&oacute;digo en lugar de pulsar la tecla que lo contiene directamente.
<P>
 Por ejemplo, nuestra denostada en medio mundo <b>&quot;&Ntilde;&quot;</b> se escribir&aacute;:
<pre>
        &#38;Ntilde;  o bien &#38;&#35;209;
</pre>
Esto habr&aacute; que hacerlo con todos los caracteres que no sean las letras del alfabeto (may&uacute;sculas y min&uacute;sculas), los n&uacute;meros y unos pocos signos, como el punto, la coma, el gui&oacute;n y algunos otros. A este conjunto de caracteres, com&uacute;n para todos los sistemas, se le denomina c&oacute;digo <b>ASCII</b>, y desde luego hay que codificar todas las letras acentuadas, e&ntilde;es, cedillas, etc., etc.
<P>
En el &iacute;ndice encontrar&aacute;s <a href="coditab.htm">una tabla con todos los caracteres</a>, tambi&eacute;n est&aacute;n las letras, pero &eacute;stas s&oacute;lo te ser&aacute;n &uacute;tiles en caso de necesitar escribir textos un tanto raros o destinados a terminales que no trabajen con la tabla ASCII.
<P>
Como puedes ver, la tabla tiene una columna con el car&aacute;cter deseado seguida de su c&oacute;digo num&eacute;rico en base <b>decimal</b>, una descripci&oacute;n del car&aacute;cter y despu&eacute;s un nombre corto (una especie de alias) que para los m&aacute;s habituales se llegan a memorizar, y para cosas cortas, ayudan. No todos tienen ese nombre corto, y esos hay que escribirlos con el c&oacute;digo num&eacute;rico. En algunos casos especiales que se ver&aacute;n m&aacute;s adelante, habr&aacute; que escribir los c&oacute;digos num&eacute;ricos en base <b>hexadecimal</b> (la calculadora de Windows tiene un conversor).
<P>
Generalmente, se pueden escribir directamente desde teclado todos los que no tienen alias en la tabla, los que s&iacute; tienen normalmente dar&aacute;n problemas en sistemas diferentes al que se ha utilizado para escribir el documento. Si lo que escribes en HTML tienes la seguridad de que s&oacute;lo va a ser utilizado como ficheros locales en m&aacute;quinas similares a la tuya, no ser&aacute; necesario complicarse la vida; pero si tus p&aacute;ginas van a residir en un servidor web, cualquier tipo de m&aacute;quina podr&aacute; acceder a ellas, y su aspecto no ser&aacute; el adecuado en algunas.
<P>
Existen multitud de editores especiales para escribir HTML, y la mayor&iacute;a de ellos tienen herramientas para convertir de forma autom&aacute;tica los caracteres especiales a su correspondiente c&oacute;digo. Tambi&eacute;n hay paquetes de &quot;macros&quot; para hacer lo mismo con procesadores de texto como Word o Word Perfect. Puedes comprobar el c&oacute;digo de un car&aacute;cter cualquiera en tu m&aacute;quina (Windows) manteniendo pulsada la tecla <b>Alt</b> y escribiendo el c&oacute;digo <b>con el teclado num&eacute;rico</b>. &nbsp; Por ejemplo, Alt 6 5 devuelve la letra <b>A</b>. &nbsp; Todos los sistemas operativos tienen similares combinaciones de teclas para esto.


<hr>
<center>
<h3>
[<a href="indice.htm">Indice</a>]
</h3>
</center>
<hr>
</body>
</html>

