<HTML>
<HEAD><TITLE>Como funciona</TITLE>

</HEAD>
<BODY>

<center>
<h3>
[<a href="indice.htm">Indice</a>]
</h3>
</center>
<hr>

<h2>&#191;C&oacute;mo funciona esto?</h2>
<P>
B&aacute;sicamente, la cosa es simple: la pieza clave es el "browser", "navegador", "visualizador" o "cliente" o como quieras llamarle, HTML, es decir, el programa que ahora mismo est&aacute;s utilizando para ver esto.<BR>
Todas las codificaciones de efectos en el texto que forman el lenguaje HTML no son m&aacute;s que instrucciones para el visualizador. Partiendo de esto, se entiende el porqu&eacute; no se ve lo mismo con todos los visualizadores. Depende de c&oacute;mo est&eacute;n dise&ntilde;ados y para qu&eacute; versi&oacute;n de lenguaje est&eacute;n dise&ntilde;ados.
<P>

Actualmente existen multitud de ellos,  aunque los m&aacute;s conocidos son el Internet Explorer de Microsoft (en lo sucesivo <b>IE</b>), el Netscape Navigator de Netscape (en lo sucesivo <b> Netscape</b>), o el Mozilla <b>Firefox</b> (que en realidad es el nuevo Netscape), y sin olvidar los navegadores <b>Opera</b> y <b>Chrome</b>, que tienen fama de ser los que m&aacute;s respetan los est&aacute;ndares, cosa muy de agradecer en estos tiempos. 
<p>
Todo lo que se dice en esta gu&iacute;a funciona correctamente con Netscape, Opera, Firefox o Chrome, casi todo con el IE. Algunas cosas puede que no se vean bien dependiendo del navegador utilizado, sobre todo si son versiones antiguas. 
<P>
Si se est&aacute; conectado a Internet, con un navegador, adem&aacute;s de ver documentos HTML se puede recibir y enviar correo electr&oacute;nico, recibir y enviar NEWS (noticias), visitar los servidores GOPHER (servidores de ficheros ya desaparecidos),  y acceder a servidores FTP (m&aacute;s servidores de ficheros) tanto en entrada como en salida, todo ello con el mismo programa. Tambi&eacute;n, como no, se pueden imprimir los documentos visualizados. Casi todos suelen ser &quot;WYSWYG&quot;, es decir, que lo impreso es exactamente como lo ves en pantalla...Siempre que tu impresora est&eacute; de acuerdo, claro.
<P>
La idea es sencilla:  s&oacute;lo tienes que crear un documento con tu editor preferido (como <b>documento</b> entenderemos el conjunto de ficheros, tanto de texto como de im&aacute;genes, que forman las distintas p&aacute;ginas), guardarlo con la extensi&oacute;n <b>.htm</b> o <b>.html</b>, abrirlo con tu navegador preferido, y ya tienes un hipertexto en marcha. Las p&aacute;ginas o  documentos creados pueden residir en el disco duro de tu ordenador personal, en un disquete, en un CD-ROM, o estar a varios miles de kil&oacute;metros en otro ordenador llamado servidor web o servidor http, que es el protocolo utilizado. Si es as&iacute;, entonces te estar&aacute;s moviendo por la WWW (World Wide Web) que es como se ha dado en llamar a este tipo de servicios de Internet.
<P>
As&iacute; pues, en esencia, una p&aacute;gina escrita en HTML no es m&aacute;s que texto normal, escrito con cualquier editor, y al que,  cuando se le quiere dar algun aspecto especial, como por ejemplo el tama&ntilde;o de la letra,  habr&aacute; que acompa&ntilde;ar de ciertos c&oacute;digos para indicar el efecto deseado. A estos c&oacute;digos se les llama <b>elementos</b> del lenguaje.
<P>
Pero no hay que olvidar que al fin y al cabo no hablamos m&aacute;s que de texto. Simple y llano texto. Por lo tanto, para montajes sencillos, en los que no se requiera ning&uacute;n efecto especial, nos podemos olvidar hasta del mism&iacute;simo HTML. El visualizador nos presentar&aacute; perfectamente cualquier p&aacute;gina &quot;.txt&quot; generada por cualquier editor, y los links entre documentos s&oacute;lo requieren un simple y sencillo comando. Y a&uacute;n as&iacute; podremos conseguir el tipo y tama&ntilde;o de letra y colores de texto y fondo que queramos, simplemente configurando el visualizador.
<p>
Como ya habr&aacute;s deducido, lo primero es crear las p&aacute;ginas en tu m&aacute;quina, es decir, en local, y eso ya te permite navegar por tu documento, simplemente abriendo las p&aacute;ginas creadas con tu navegador preferido. Si lo que quieres es ponerlas en Internet (algunos a eso le llaman "colgarlas" en Internet), lo siguiente es conseguir una cuenta y espacio en disco en algun proveedor de servicios internet (<b>ISP &nbsp;-I</b>nternet <b>S</b>ervice <b>P</b>rovider-), si no tienes tu propio servidor, claro. Una vez conseguido el espacio en servidor, hay que enviar los ficheros que contienen tus p&aacute;ginas a ese servidor. Para ello puedes utilizar la p&aacute;gina que habitualmente proporcionan los ISP para "subir" tus ficheros desde tu m&aacute;quina, o bien utilizar algun programa de FTP, configur&aacute;ndolo seg&uacute;n las instrucciones del ISP. Suele ser m&aacute;s sencillo utilizar las p&aacute;ginas proporcionadas por los ISP. 
<p>
Recuerda que dependiendo del sistema operativo que tenga el servidor, los nombres de los ficheros deben atenerse a ciertas convenciones. Si el servidor utiliza una plataforma UNIX o LINUX (la mayor&iacute;a de ellos) los nombres no pueden tener espacios en blanco, y adem&aacute;s se tienen en cuenta las may&uacute;sculas. No es lo mismo <b>Index.html</b> que <b>index.html</b>. Otra cosa importante es que <b>nunca</b> utilices palabras con acentos o caracteres especiales, como e&ntilde;es, cedillas, etc. para dar nombre a los ficheros. Si el servidor utiliza sistemas Windows esto carece de importancia, pero hay que tener en cuenta que tus p&aacute;ginas, antes de llegar al cliente, tendr&aacute;n que pasar por muchos nodos enrutadores que generalmente son m&aacute;quinas UNIX. Otra cosa que hay que tener en cuenta, es el nombre por defecto de la primera p&aacute;gina de tu documento. Casi todos los  servidores basados en UNIX o LINUX consideran como primera p&aacute;gina cualquier fichero llamado <b>index.html</b>. Si no existe este archivo, o el que establezca el administrador del sistema, es necesario que el usuario escriba el nombre de la primera p&aacute;gina del documento que desea visitar. Por ejemplo, si no utilizas el nombre incial que por defecto admita tu servidor, la direcci&oacute;n se tiene que escribir completa:
<p>
<FONT FACE="COURIER">http://mi_servidor/mi_usuario/mi_pagina_inicial.htm</font>
<p>
Si utilizas como nombre de la primera p&aacute;gina el aceptado por el servidor, solamente habr&iacute;a que escribir hasta el directorio:
<p>
<FONT FACE="COURIER">http://mi_servidor/mi_usuario/</font>
<p>
Y si tienes la suerte de disponer de tu propio servidor, solamente se precisa el nombre del servidor:
<p>
<FONT FACE="COURIER">http://mi_servidor/</font>
<p>

Si est&aacute;s dise&ntilde;ando tu documento y solamente quieres ver tu trabajo en local, los navegadores funcionan igual que cualquier otro programa de Windows, y con la opci&oacute;n "Archivo/Abrir" de tu navegador preferido puedes ver cualquier fichero escrito en HTML. En ese caso, la ruta ser&aacute; de este estilo:
<p>
<FONT FACE="COURIER">file:///C:/mi_web_local/mi_pagina.htm</font>
<p>

<hr>
<center>
<h3>
[<a href="indice.htm">Indice</a>]
</h3>
</center>
<hr>

</BODY>
</HTML>
