<html>

<head>
<title> HTML5 </title>
</head>

<body>
<center>
<h3>
[<a href="indice.htm">Indice</a>]
</h3>
</center>
<hr>

<H3>Contin&uacute;a la evoluci&oacute;n: el html5 </H3>

<h4>Un poco de historia</h4>

Como ya sabrás, las definiciones oficiales de las distintas versiones del html emanan del w3c (World Wide Web Consortium). Este organismo viene a ser una especie de "Academia de la Lengua" que establece los est&aacute;ndares del lenguaje, a fin de hacer menos ca&oacute;tica la programaci&oacute;n de las p&aacute;ginas web. Aunque no siempre lo consigue. Veamos la evoluci&oacute;n hasta ahora del html.
<ul>
<li><b>1989</b> Aparece el html, que pronto sufri&oacute; varias  revisiones: html 2, html 3.2, html 4 y el html 4.01

<li><b>2000</b> Se presenta el Xhtml 1 como la evoluci&oacute;n natural de un html que deber&iacute;a dejar de usarse (a la vista est&aacute; que no fue as&iacute;).

<li><b>2002</b> Se comienza a definir Xhtml 2, una actualizaci&oacute;n de Xhtml 1 con varias mejoras sem&aacute;nticas pero sin compatibilidad regresiva; era realmente un lenguaje nuevo. 

<li><b>2004</b> Se constituye el Web Hypertext Application Technology Working Group (Whatwg), un grupo de trabajo nacido al margen del W3C con el prop&oacute;sito de crear una nueva versi&oacute;n del est&aacute;ndar desde un punto de vista destacadamente pr&aacute;ctico, y no tan acad&eacute;mico. Y es que siete a&ntilde;os despu&eacute;s de que el W3C publicase las recomendaciones oficiales de Html 4.01 y Xhtml 1, a&uacute;n no hab&iacute;a ning&uacute;n consenso salido del W3C sobre el camino que se deb&iacute;a seguir (¿lo habr&aacute; alguna vez?.

<li><b>2007</b> el W3C reconoce el trabajo del Whatwg y lo toma como base para proponer una nueva actualizaci&oacute;n del est&aacute;ndar. 

<li><b>2009</b> El w3c abandona definitivamente, y antes de terminar su desarrollo, el Xhtml 2, y se concentra en definir html5. Desde entonces ha habido bastante confusi&oacute;n  sobre c&oacute;mo deber&iacute;a ser el lenguaje para el futuro desarrollo de la Web, y a&uacute;n hoy no est&aacute; nada claro.

</ul>

La consecuenca de esta err&aacute;tica trayectoria del lenguaje ha sido que en el ciberespacio hay p&aacute;ginas de todos los tipos posibles,  y que los navegadores han tenido que adaptarse a todas las versiones aparecidas, ya que casi nadie ha abandonado su versi&oacute;n preferida ante la incertidumbre de cu&aacute;l va a ser la buena, y mucho menos se han reescrito las p&aacute;ginas ya creadas hace alg&uacute;n tiempo. Con el tiempo, el W3C ha acabado aceptando de facto, que el xhtml (aunque t&eacute;cnicamente en vias de extinci&oacute;n) sea una recomendación paralela que puede coexistir con el html. ¿Cuantas veces va a haber que reescribir las p&aacute;ginas? 
<p>

Al parecer, esta nueva versi&oacute;n se hace para intentar resolver, una vez m&aacute;s,  los viejos problemas de toda la vida, como por ejemplo, los contenidos multimedia y el l&iacute;o de los plug-ins. Para ello, se implementan nuevos elementos, como &lt;video&gt; o &lt;audio&gt;, es decir, se pretende que sea el propio navegador el que sin necesidad de plug-ins, activeX, ni elementos extraños al propio navegador, pueda reproducir correctamente cualquier tipo de fichero, cosa que ya se intent&oacute; con el elemento &lt;object&gt;. Pero este elemento lo &uacute;nico que facilitaba era la conexi&oacute;n con el reproductor, no era un reproductor en s&iacute; mismo. Evidentemente, para que esta idea funcione, ser&aacute; necesario definir un tipo de video y de audio al que convertir cualquier otra fuente multimedia, siempre que sea compatible la conversi&oacute;n, claro. Algo as&iacute; como lo que hasta ahora se ven&iacute;a haciendo con Flash, pero con c&oacute;digo libre y abierto. ¿Puede ser el fin de Flash?
<p>
<hr>
<center>
<h3>
[<a href="indice.htm">Indice</a>]
</h3>
</center>

</body>
</html>
