
<html>
<head>
<title>Ultimas innovaciones   </title>
</head>

<body>
<center>
<h3>
[<a href="indice.htm">Indice</a>]
</h3>
</center>
<hr>

<h2>Ultimas innovaciones</h2>
El HTML, como cualquier otro lenguaje, no est&aacute; terminado ni lo estar&aacute; nunca. D&iacute;a a d&iacute;a se le van implementando nuevas utilidades que le hacen, si cabe, m&aacute;s atractivo y pr&aacute;ctico. Hay que distinguir entre lo que son elementos &quot;oficiales&quot; del lenguaje, y las implementaciones que los creadores de cada visualizador le van a&ntilde;adiendo a sus respectivos programas. Buena muestra de ello son los CGI y los applets, plug-ins y JavaScripts de Netscape y los ActiveX de Microsoft.
<p>
 
No hay que confundir los <b>applets</b> con los plug-ins o los CGI. En la versi&oacute;n 2.0, Netscape introdujo extensiones al lenguaje HTML para permitir incorporar un programa escrito en Java a un documento HTML, del mismo modo que se puede insertar, por ejemplo, una imagen. A estos programas, se les denomina &quot;applets&quot;. Son programas dise&ntilde;ados para un fin concreto dentro de la p&aacute;gina, como producir una animaci&oacute;n o filtrar la entrada de informaci&oacute;n en un formulario. Los <b>JavaScripts</b> no son applets, no tienen la entidad de aut&eacute;nticos programas, y sus acciones son m&aacute;s limitadas al estar restringido su radio de acci&oacute;n a la ventana del navegador. En realidad, y aunque  no forma parte del HTML oficial, podr&iacute;a considerarse el java interpretado, como una extensi&oacute;n del HTML, igual que las tablas, o cualquier otro elemento, aunque un poco más complejo, al tratarse de un lenguaje basado en objetos y muy parecido al lenguaje C.
<p>
Los <b>plug-ins</b>, en cambio, son m&oacute;dulos de software (programas) que se ensamblan con el visualizador, a&ntilde;adi&eacute;ndole nuevas prestaciones o habilidades, que le permitirán decodificar nuevos formatos para los que no estaba preparado originalmente, como el VRML, para la navegación en mundos 3D,  el Adobe Flash para presentaciones hechas con Flash Player o el Acrobat Reader para ver documentos generados en formato .pdf &nbsp;  De esto se deduce que, si no se le han instalado los plug-ins necesarios a nuestro visualizador, al intentar leer una página con, por ejemplo, un fichero de vídeo, lo que &eacute;ste har&aacute; es pedirnos el nombre de un programa auxiliar para que sea &eacute;l quien gestione ese fichero en lugar de procesarlo por s&iacute; mismo, o nos propondr&aacute; descargar el fichero para utilizarlo m&aacute;s tarde.
<p>
Todo esto, es respecto a Netscape (o Mozilla). Microsoft lleg&oacute; tarde, pero por supuesto, tiene algo parecido: el <b>Active X</b>. Esto no es m&aacute;s que un peque&ntilde;o m&oacute;dulo capaz de hacer de enlace entre el Internet Explorer (el visualizador de Microsoft) y paquetes de desarrollo como MS Visual Basic, MS Visual J++ o aplicaciones de uso com&uacute;n como MS Excel, o con recursos del sistema. Estas habilidades tienen dos problemas graves: que s&oacute;lo puede utilizarse en entornos Microsoft, lo que le resta la portabilidad intersistemas que tiene Java, y que al ser capaz de conectar directamente con los recursos del sistema, los fallos de seguridad son muchos m&aacute;s peligrosos.
<p>
Te habr&aacute;s dado cuenta, de que todo lo dicho es referido siempre al propio navegador, es decir que se trata de acciones realizadas en <b>local</b>, en tu propia m&aacute;quina, y por tanto no es necesario estar conectado a una red. Los programas <b>CGI</b> se ejecutan en el servidor, es decir en <b>remoto</b>, y s&iacute; es necesario estar conectado a la red. Constituyen una soluci&oacute;n m&aacute;s fiable que las anteriores, ya que las m&aacute;quinas donde residen los servidores, suelen ser mucho m&aacute;s potentes que los PC's clientes, y con m&aacute;s recursos siempre disponibles (o por lo menos deber&iacute;a ser as&iacute;), lo que permite realizar cualquier dise&ntilde;o por complicado que sea, sin obligar a quien se conecta a tener un ordenador caro, o con todos los plug-ins instalados, pero su eficacia depende absolutamente de la velocidad de la red, que a veces es desesperante...  Aunque se mencionan aqu&iacute; a efectos de comparaci&oacute;n, los CGI no son nuevos, ya que aparecieron en las primeras versiones oficiales del HTML.
<p>
La pen&uacute;ltima novedad del HTML es algo que pr&aacute;cticamente terminar&aacute; con &eacute;l: las hojas de estilo en cascada (CSS). En efecto, al poco de implementarse este avance, y aunque el HTML todav&iacute;a goza de buena salud, la W3C ha establecido un nuevo est&aacute;ndar: el XHTML, que es una modificaci&oacute;n del HTML junto con CSS. B&aacute;sicamente el XHTML es igual que el HTML, pero eliminando algunos elementos y basando el dise&ntilde;o en el desarrollo de hojas de estilo en casacada, obligatorias, puesto que el nuevo XHTML no tiene elementos de estilo propios. Al mismo tiempo, se pretende que el lenguaje sea m&aacute;s estricto a la hora de escribirlo.
<p>
Un nuevo invento, aparecido en 2005, es el lenguaje AJAX. Esto es un acr&oacute;nimo de <b>A</b>synchronous <b>J</b>avaScript <b>A</b>nd <b>X</b>ML (JavaScript y XML as&iacute;ncronos, donde XML es, a su vez, otro acr&oacute;nimo de e<b>X</b>tensible <b>M</b>arkup <b>L</b>anguage).
<p>
M&aacute;s que un lenguaje, consiste en una t&eacute;cnica de desarrollo web para crear aplicaciones interactivas que se ejecutan en el cliente, es decir, en el navegador del usuario, y mantiene comunicaci&oacute;n as&iacute;ncrona con el servidor en segundo plano. De esta forma es posible realizar cambios sobre la misma p&aacute;gina sin necesidad de recargarla entera de nuevo. Esto significa aumentar la interactividad y la velocidad (si la red lo permite, claro), aunque no est&aacute; muy claro que mejore la usabilidad. Por supuesto, s&oacute;lo funciona en navegadores de &uacute;ltima generaci&oacute;n. La idea consiste en  combinar cuatro tecnolog&iacute;as ya existentes:
<ul>
    <li> XHTML (o tambi&eacute;n HTML) y hojas de estilos en cascada (CSS).

    <li> Document Object Model (DOM), que es una forma de representar los elementos de un documento estructurado (tal como una página web escrita en HTML o un documento XML) como objetos que tienen sus propios m&eacute;todos y propiedades, y a las que se accede con un lenguaje de scripting  como JavaScript o JScript.

    <li> El nuevo objeto <b>XMLHttpRequest</b> para intercambiar datos de forma as&iacute;ncrona con el servidor web.
    <li> JavaScript. En realidad, nada de esto funcionar&iacute;a sin &eacute;l.
    
</ul>
<p>
Como el DHTML o ASP,  AJAX no constituye una tecnolog&iacute;a en s&iacute; misma, sino que es un t&eacute;rmino que engloba a un grupo de &eacute;stas que trabajan conjuntamente. Aunque se utiliza en las p&aacute;ginas web convencionales (por ejemplo, Gooble o Google maps), fue desarrollado para crear aplicaciones de terminales de telefon&iacute;a m&oacute;vil. Como puedes ver, casi todo depende en realidad del navegador, y estas nuevas tecnolog&iacute;as hacen que haya que plantearse, una vez m&aacute;s, para cu&aacute;l de ellos conviene programar.
<p>
En estos momentos, se est&aacute; produciendo una paradoja: mientras las t&eacute;cnicas de programaci&oacute;n tienden a la interactividad plena de las aplicaciones sin importar la carga que esto provoque en la red, las compa&ntilde;ias de comunicaciones no est&aacute;n mejorando sustancialmente la capacidad de las redes, produci&eacute;ndose grandes diferencias de rendimiento entre zonas (y de precio por sus servicios).
<p>
Y una vez m&aacute;s el W3C, dando un bandazo en su trayectoria, abandona la terminaci&oacute;n de lo que iba a ser el XHTML2, y se lanza a definir un nuevo est&aacute;ndar: <b>HTML5</b>. Esta nueva versi&oacute;n, al igual que el XHTML, no tendr&aacute; instrucciones de estilo propias, y ser&aacute; CSS la encargada de ello, eso s&iacute;, tambi&eacute;n con una nueva versi&oacute;n: la <b>CSS3</b>.  
</p>
<hr>
<center>
<h3>
[<a href="indice.htm">Indice</a>]
</h3>
</center>

</body>
</html>


