<HTML>
<HEAD><title>Notas</title></HEAD>
<BODY>

<center>
<h3>
[<a href="indice.htm">Indice</a>]
</h3>
</center>
<hr>
<H2>Notas sobre el lenguaje</h2>
<P>
El HTML (<b>H</b>yper <b>T</b>ext <b>M</b>arkup <b>L</b>anguage) es un lenguaje  que sirve para escribir hipertexto, es decir, documentos de texto presentado de forma estructurada, con enlaces (links) que conducen a otros documentos o a otras fuentes de informaci&oacute;n (por ejemplo bases de datos) que pueden estar en tu propia m&aacute;quina o en m&aacute;quinas remotas de la red. Todo ello se puede presentar acompa&ntilde;ado de cuantos gr&aacute;ficos est&aacute;ticos o animados y sonidos seamos capaces de imaginar.
<P>
Por supuesto, la estética de los documentos escritos en HTML no se limita a texto digamos normal; consigue todos los efectos que habitualmente se pueden producir con un moderno procesador de textos: negrita, cursiva, distintos tama&ntilde;os y fuentes, tablas, p&aacute;rrafos tabulados, sangr&iacute;as, incluso texto y fondo de p&aacute;gina de colores, y muchos m&aacute;s. 
<P>
Posiblemente te dir&aacute;s que todo esto est&aacute; muy bien, pero que t&uacute; no vas a tener la necesidad o posibilidad de desarrollar uno de esos famosos WWW de los que todo el mundo habla, a veces sin saber demasiado bien de qu&eacute; habla.
<P>
Mucha gente asocia este lenguaje (que en realidad casi ni siquiera es un lenguaje, sino una forma de definir efectos en el texto de manera similar a como se hac&iacute;a en los antiguos procesadores de texto para DOS;) con complicados y poderosos servidores de informaci&oacute;n que misteriosamente alguien programa, y que seguramente es un genio en estas cuestiones, y piensa que en el trabajo cotidiano o incluso en casa, esto no sirve para nada....
<P>
Pues no es as&iacute;. Esto es muy sencillo y m&aacute;s pr&aacute;ctico de lo que parece. Evidentemente, si lo que quieres es montar un servidor de informaci&oacute;n con miles de p&aacute;ginas, links a varias bases de datos tanto locales como remotas, posibilidad de b&uacute;squedas indexadas, gr&aacute;ficos animados, sonido, p&aacute;ginas interactivas, etc., etc., necesitar&aacute;s saber algo m&aacute;s que simple HTML. Pero has pensado en:<BR>

<ol>

<li>&#191;Poner en limpio de una vez por todas esas notas que tienes desperdigadas, llenas de llamadas de unas a otras y que no hay manera de encontrar?
<li>&#191;Presentar tu colecci&oacute;n de sellos con una imagen escaneada de cada uno y un comentario sobre su tema, y organizado por a&ntilde;os, valores, o lo que se te ocurra?
<li>&#191;Idem de la colecci&oacute;n de discos?
<li>&#191;Montar el &aacute;lbum de fotos de familia con un texto explicativo de cada una?
<li>&#191;Organizar tu biblioteca, incluyendo el &iacute;ndice escaneado de cada libro y haciendo links entre temas?
<li>&#191;Las fotos del &uacute;ltimo viaje de vacaciones, incluyendo llamadas a los planos de las ciudades visitadas, y a todas las historias que te contaron en cada sitio?
<li>&#191;Si eres estudiante, presentar al &quot;profe&quot; tu pr&oacute;ximo trabajo lleno de diagramas, gr&aacute;ficos, tablas, colores... en un CD o cualquier otro soporte?
<li>&#191;Organizar para siempre y poner al alcance de todos ese cat&aacute;logo o list&iacute;n siempre perdido en la oficina?
<li>&#191;Preparar los temas de legislaci&oacute;n, llenos de referencias cruzadas, de esas oposiciones que te llevan de cabeza?
</ol>

En fin, la lista puede ser infinita. Pero esto es bastante sencillo de conseguir. &#191;Qu&eacute; necesitas para empezar? pues solamente un editor de texto cualquiera (desde Word al humilde "Bloc de notas" de Windows), un visualizador WWW como el que est&eacute;s usando ahora... y haberte le&iacute;do esto.

<hr>
<center>
<h3>
[<a href="indice.htm">Indice</a>]
</h3>
</center>
<hr>

</BODY>
</HTML>
