<html>
<head>
<title>Proposito   </title>
</head>

<body>
<center>
<h3>
[<a href="indice.htm">Indice</a>]
</h3>
</center>
<hr>

<H2> Prop&oacute;sito de este documento  </H2>
<b>Algunas reflexiones</b>
<P>
Estas p&aacute;ginas han sido creadas como parte del material para impartir un breve cursillo sobre el mundo WWW, en particular, y las herramientas para moverse por la  INTERNET, en general, a un grupo de estudiantes con pocos o nulos conocimientos inform&aacute;ticos.
<P>
Al escribir esto comenc&eacute; como suelen comenzar casi todos los manuales que pueden encontrarse a lo largo y ancho del ciberespacio, pero en mitad de una farragosa explicaci&oacute;n sobre el ISO 8859-1, pens&eacute;: <i>&quot;... bueno, esto en realidad no necesitan saberlo... pero, todo sea por el rigor t&eacute;cnico...&quot;</i>. Y entonces hice una prueba... Le di a leer lo que acababa de escribir a un &quot;conejillo de indias&quot; que pasaba por all&iacute; y que de esto s&oacute;lo conoc&iacute;a &quot;eso que dicen por la tele de las autopistas de la informaci&oacute;n...&quot;.
<P>
El resultado, como era de esperar, fue algo peor que desastroso. De las cinco primeras l&iacute;neas, s&oacute;lo comprendi&oacute; una docena de palabras, y de las restantes, sus preguntas daban pie a pensar que era algo m&aacute;s que un breve cursillo lo que har&iacute;a falta para que saliese medianamente enterado.
<P>
Y sin embargo, yo tengo claro que el HTML no es tan dif&iacute;cil. Pero,  &#191;cu&aacute;l es el objetivo real? Simple: saber lo necesario para poder hacer una p&aacute;gina personal en un servidor ya instalado.
<P>
Evidentemente, habr&aacute; que partir de unos leves conocimientos de &quot;entorno&quot;: como haber manejado un procesador de textos en Windows, saber guardar un fichero donde uno quiere y poco m&aacute;s que sea realmente imprescindible. Y esto es poco m&aacute;s o menos lo que saben la mayor&iacute;a de usuarios.
<P>
Hab&iacute;a que olvidar el &quot;rigor t&eacute;cnico&quot;, y escribir las cosas de forma que no se requiriera ser analista de sistemas para comprenderlas, y sobre todo, pensando qu&eacute; es lo realmente necesario para poder obtener resultados aceptables, que animen al estudiante en un tiempo razonable pero sin dejar de lado los conocimientos de altura, que ser&aacute;n demandados por el propio alumno a medida que avanza.
<P>
Esto no es un manual de referencia. Ni siquiera es un manual. No hay referencias t&eacute;cnicas ni siglas, ni lenguaje t&eacute;cnico... ni por supuesto, est&aacute; &quot;todo&quot; sobre el HTML. Es una serie de apuntes donde no falta  nada de lo que hace atractivo el HTML, con ejemplos de los de cortar y pegar, como un recetario. Algunas cosas son, por naturaleza, algo complejas,  y puede que tengas que preguntar, es inevitable. Aunque espero que sean las menos, y que despu&eacute;s de leer esto, ya puedas trabajar sin ayuda.
<P>
<b>C&oacute;mo utilizar &eacute;ste documento</b>
<P>
No te aconsejo que te &quot;empolles&quot; toda la gu&iacute;a. Solamente hoj&eacute;ala. Ahora se trata de que sepas lo que <b>se puede hacer</b>, no <b>c&oacute;mo se puede hacer</b>. Cuando te hayas dado un ligero ba&ntilde;o de sabidur&iacute;a HTML, piensa lo que quieres hacer. El dise&ntilde;o inicial es importante,  comienza a editar tu primera p&aacute;gina. No temas cometer errores, no se puede romper nada. Lo peor que puede pasar es que no funcione. 
<P>
Cuando ya tengas algo escrito, pru&eacute;balo. Si algo no funciona, busca la sintaxis  correcta,  ves complicando el documento poco a poco, &quot;tirando de gu&iacute;a&quot; cuando te atasques. Copia algunos ejemplos y modif&iacute;calos. Compara su funcionamiento antes y despu&eacute;s. 
<hr>
<center>
<h3>
[<a href="indice.htm">Indice</a>]
</h3>
</center>

</body>
</html>


