<html>
<head>
<title>Proposito 2  </title>
</head>

<body>
<center>
<h3>
[<a href="indice.htm">Indice</a>]
</h3>
</center>
<hr>

<H2> Prop&oacute;sito de este documento  (varios a&ntilde;os despu&eacute;s)</H2>
<b>M&aacute;s reflexiones</b>
<P>
Como ya se ha dicho, estas p&aacute;ginas fueron creadas, all&aacute; por el ya lejano 1996 (en inform&aacute;tica esto es casi como hablar del jur&aacute;sico),  como material para un curso, es decir, sin &aacute;nimo de continuidad y para un grupo de alumnos de caracter&iacute;sticas muy definidas. Una vez cumplido su destino inicial, nada parec&iacute;a indicar que pudieran tener otro que no fuese la papelera. Y en efecto, ese fue. Pero los alumnos del curso pensaron que, al igual que a ellos, le podian servir a otros, y comenzaron a difundir la direcci&oacute;n del servidor donde se hab&iacute;a quedado una copia. Hoy, a&ntilde;os despu&eacute;s, se han servido m&aacute;s de un mill&oacute;n de copias y he tenido que responder a miles de e-mails con las m&aacute;s variadas consultas. 
<p>
No han faltado comentarios en contra de su estilo, de su contenido, e incluso de quien duda que a estas alturas alguien pueda escribir una sola l&iacute;nea as&iacute;, "a mano", sin recurrir a un asistente de los muchos que existen y que te lo dan todo hecho. Afortunadamente, han sido pocos los cr&iacute;ticos y muchos los satisfechos, y estos &uacute;ltimos son los que constantemente han demandado m&aacute;s contenidos;  gracias a ellos la gu&iacute;a sigue en la red.
<p>
Para quienes piensan que es mejor utilizar un asistente.... son muy libres... No obstante, hay quien prefiere saber lo que est&aacute; haciendo. Profesionalmente he tenido ocasi&oacute;n de formar parte de algunos tribunales de selecci&oacute;n de personal. Uno de los requisitos solicitados era saber HTML, y resultaba lastimoso ver el poco HTML que sabian casi todos los candidatos, que manejaban con soltura los asistentes, pero que a la hora de analizar su propio trabajo "por dentro" fallaban estrepitosamente, y no digamos si la propuesta era modificar o a&ntilde;adir alguna cosa de las que los asistentes no hacen. Y es que nada tratado en profundidad, resulta tan sencillo como parece.
<p>
A la vista de las consultas, cr&iacute;ticas y parabienes recibidos, se observa que los lectores abarcan un amplio espectro de usuarios: desde el aficionado que se inicia en estas lides, hasta el nuevo profesional que tiene unas necesidades muy concretas, lo que explica la gran variedad de peticiones de nuevos contenidos recibidas. 
<p>
Como la revisi&oacute;n constante de la gu&iacute;a requiere de un tiempo del que no dispongo, y dado que profesionalmente me dedico a la programaci&oacute;n de gesti&oacute;n, aplazo, que no descarto, la inclusi&oacute;n de temas tan solicitados como el Java Script, Visual Basic Script, Perl, etc., etc., y por el momento, me limitar&eacute; a incluir peque&ntilde;os fragmentos de aplicaciones de gesti&oacute;n, aquellos que considere m&aacute;s interesantes a nivel general... por la sencilla raz&oacute;n de que los tendr&eacute; ya hechos. Es posible que queden un poco escasos de explicaciones b&aacute;sicas, pero tal vez algun dia....
<p>
<h3>Pero, ¡si esto está anticuado!</h3>
En efecto, en este documento encontrarás cosas que profesionalmente ya no se utilizan, lo que no siginifica que no funcionen. De momento no pienso borrar nada, y tengo buenas razones para ello. El HTML, como todo, ha evolucionado y  ser&aacute; sustituido por un nuevo est&aacute;ndar: el XHTML, nacido despu&eacute;s del auge que han tomado las hojas de estilo en cascada (CSS), y &eacute;ste, a su vez, ser&aacute; desplazado por el html5, que no tardando mucho, ser&aacute; sustituido por otro est&aacute;ndar. Hay quien sostiene que se deben escribir las p&aacute;ginas con la &uacute;ltima tecnolog&iacute;a disponible en el mercado y respetando escrupulosamente los est&aacute;ndares... Me parece correcto, siempre que se pueda disponer de esa tecnolog&iacute;a y se tenga la capacidad suficiente para desarrollar con lenguaje estricto. En nuestro despilfarrador "primer mundo" es relativamente sencillo obtener lo &uacute;ltimo de lo &uacute;ltimo, pero desgraciadamente eso no ocurre en todas partes; ni todos los que se lanzan a escribir una p&aacute;gina la quieren para entretenerse, ni para ganar dinero, ni son capaces de comprender los postulados de la W3C, ni tienen capacidad para escribir maquetando en capas. 
<p>
Las mayores satisfacciones que me ha proporcionado este documento han sido algunos e-mails recibidos de un humilde maestro de una aldehuela perdida en algun remoto rinc&oacute;n, que trabajando con una m&aacute;quina 486 encontrada en la chatarra, y un editor MSDOS consigui&oacute; crear una p&aacute;gina para que la gente de su pueblo pudiera exponer sus muchas necesidades al mundo, logrando que una comisi&oacute;n de UNICEF apareciese por all&iacute;. Esta p&aacute;gina, y otras muchas creadas o mantenidas en lugares donde la precariedad no tiene l&iacute;mites, no cumplen los requisitos que marca la W3C, ni estan escritas con la &uacute;ltima versi&oacute;n del lenguaje, ni tienen hoja de estilos. A veces, ni siquiera tienen m&aacute;s de 16 colores. Pero sirven para mucho m&aacute;s que la mejor p&aacute;gina dise&ntilde;ada con el m&aacute;s lujoso de los paquetes de desarrollo, con cuyo solo importe esa peque&ntilde;a escuela funcionar&aacute; varios a&ntilde;os.
<p>
El HTML, el viejo, entra&ntilde;able y f&aacute;cil HTML, se ha convertido en algo m&aacute;s que un lenguaje de programaci&oacute;n; no es como tantos otros de los que existen en inform&aacute;tica. &Eacute;ste tiene algo de especial, casi de m&aacute;gico. El enorme calado social que ha conseguido internet en el mundo, probablemente no se habr&iacute;a logrado si escribir una p&aacute;gina s&oacute;lo estuviese al alcance de un profesional inform&aacute;tico. Es indudable que debe evolucionar de forma acorde a las nuevas necesidades, pero creo necesario separar la programaci&oacute;n profesional de la vieja herramienta que ha permitido tantas cosas, cosas que no se pueden medir con par&aacute;metros de eficacia profesional. Mal que le pese al corporativismo de algunos, el HTML ya forma parte del patrimonio de la humanidad.

<hr>
<center>
<h3>
[<a href="indice.htm">Indice</a>]
</h3>
</center>

</body>
</html>


