<html>
<head>
<title>Introduccion a la Gestion </title>
</head>

<body>
<center>
<h3>
[<a href="../indice.htm">Indice</a>]
</h3>
</center>
<hr>

<H2> Introducci&oacute;n a las aplicaciones de gesti&oacute;n</H2>
<b>Una reflexi&oacute;n sobre los misterios de la vida.</b>
<p>
En estos tiempos hay montones de gente que tiene coche, televisor y grifos en su casa. Casi todo el mundo se considera usuario experto de aparatos que utiliza todos los dias. No obstante, es rar&iacute;simo ver a alguien que si se le aver&iacute;a, por ejemplo el coche, decida repararlo por s&iacute; mismo. Incluso conozco quien, ante un simple pinchazo, llama a la grua. <i>".. Yo no soy  mec&aacute;nico.."</i> dicen entre asombrados e indignados. En la misma l&iacute;nea, casi nadie se considera electricista, ni fontanero, ni por supuesto, m&eacute;dico o arquitecto. 
<p>
Pero llegamos a los ordenadores, y de repente las cosas cambian. Por m&aacute;s que la inform&aacute;tica sea una carrera universitaria, igual que la de medicina, arquitectura o cualquier otra destreza, de las que casi nadie parece dispuesto a declararse "enterado" a pesar de haberlas estudiado alguna vez (&iquest;qui&eacute;n recuerda la qu&iacute;mica o la f&iacute;sica que aprendi&oacute; en la escuela?), llegamos a la inform&aacute;tica y todo el mundo pretende estar al dia en ella.
<p>
 Se oye hablar de software o de internet con la misma soltura que de f&uacute;tbol (de esto tambi&eacute;n sabe todo el mundo, aunque no hayan tocado un bal&oacute;n en su vida). Desde todos los medios de comunicaci&oacute;n se dan noticias de la aparici&oacute;n de tal o cual virus inform&aacute;tico, como si de ello dependiera que el mundo siga dando vueltas. Mientras,  nadie le hace caso al virus de la gripe, aunque acabes pill&aacute;ndolo cada a&ntilde;o. O los anuncios que prometen convertirte en  programador "profesional" en c&oacute;modos fasc&iacute;culos semanales. Me gustar&iacute;a ver un anuncio que prometa convertirme en f&iacute;sico nuclear por el mismo procedimiento....
<p>
&iquest;Qu&eacute; tiene la inform&aacute;tica de especial para ser tan maltratada? Aunque se pretenda que en el futuro ser&aacute; una herramienta imprescindible (&iquest;m&aacute;s que el coche hoy dia?) &iquest;a qu&eacute; se debe ese af&aacute;n por dominarla? &iquest;C&oacute;mo es posible que una disciplina tan sumamente compleja sea considerada de forma tan simple?. 
<p>
Seguramente no te has detenido a pensar en todas las &aacute;reas de conocimiento que incluye la inform&aacute;tica: Un superinform&aacute;tico capaz de conocer el funcionamiento de cualquier elemento de un ordenador, deber&iacute;a dominar, por lo menos, las siguientes: Matem&aacute;ticas, F&iacute;sica, Qu&iacute;mica, Telecomunicaciones, Electr&oacute;nica, Rob&oacute;tica, Inform&aacute;tica (en todas sus ramas: Sistemas Operativos, Lenguajes de programaci&oacute;n, An&aacute;lisis de Sistemas, Gesti&oacute;n, etc.)... Un poco complicado para aprenderlo en 20 &oacute; 30 fasc&iacute;culos, &iquest;verdad?
<p>
<b>Esto ya no es tan f&aacute;cil.</B><p>
A partir de aqu&iacute, te recomiendo  que leas con atenci&oacute;n todos los temas que siguen antes de acometer tu primer proyecto de aplicaci&oacute;n. Es importante que te hagas una idea general de lo que es una aplicaci&oacute;n de gesti&oacute;n, que conozcas algunos t&eacute;rminos nuevos. Estos conceptos no son tan simples de definir como los del HTML vistos hasta ahora. Si no los comprendes a la primera, no desesperes, termina de leerlos y vuelve a comenzar. Ve probando los ejemplos y escribe otros hasta que las dudas se te disipen. Ten presente que, al margen de lo que aqu&iacute; se explique, hay una parte muy importante que es la administraci&oacute;n y configuraci&oacute;n del servidor. Y recuerda que en estas p&aacute;ginas no est&aacute; todo, s&oacute;lo una min&uacute;scula parte de lo que es el inmenso mundo de la programaci&oacute;n. El resto habr&aacute;s de encontrarlo por tu cuenta. En internet como en los libros, est&aacute; todo: el problema es encontrarlo.
<p>
<b>&iquest;Qu&eacute; es la gesti&oacute;n remota?</b>
<P>
Entenderemos como <b>aplicaci&oacute;n de gesti&oacute;n</b>  aquella que se dise&ntilde;a para sustituir uno o varios procedimientos, tanto comerciales como administrativos, que habitualmente realiza una persona en una empresa o instituci&oacute;n de forma presencial, por una serie de pantallas en un ordenador, que permitan realizar al cliente los mismos procedimientos de forma no presencial. Esta definici&oacute;n tambi&eacute;n ser&iacute;a v&aacute;lida para la "oficina virtual", vocablo de nuevo cu&ntilde;o muy en boga &uacute;ltimamente.
<p>
No m&aacute;s desplazamientos, fuera colas, no hay horario (sea el que sea, siempre nos viene mal), se acabaron las llamadas a ese tel&eacute;fono que siempre comunica.... Suena bonito... &iquest;verdad? pues es posible.... aunque no f&aacute;cil. Dejemos nuestro revoloteo virtual, y aterricemos en el duro suelo de la realidad. Bien venidos al planeta de los programadores de gesti&oacute;n, extra&ntilde;a especie, dura, de moral indestructible, capaz de realizar las m&aacute;s increibles piruetas ante el siempre hostil p&uacute;blico de los usuarios, y capaz adem&aacute;s de trabajar horas y horas en sus proyectos... sin pedir m&aacute;s sueldo.... Extra&ntilde;a y peligrosa especie, no cabe duda.
<p>
Si te vas a dedicar a esto, recuerda que la  gesti&oacute;n es la m&aacute;s ingrata de todas las ramas de la programaci&oacute;n. Hagas lo que hagas, nunca conseguir&aacute;s que acepten tu trabajo de buen grado, aunque, eso s&iacute;, nadie te har&aacute; jam&aacute;s ninguna sugerencia constructiva: sencillamente no te entender&aacute;n. Cuando creas que ya lo tienes todo controlado y a los usuarios adiestrados (hasta donde ello es posible), la empresa tendr&aacute; unas nuevas necesidades, que indefectiblemente ser&aacute;n incompatibles con casi todo lo desarrollado...
<p>
Pero no todo son inconvenientes: S&oacute;lo t&uacute; ser&aacute;s capaz de ver la necesidad de que tal  programa debe funcionar as&iacute; y no de otra manera. S&oacute;lo t&uacute; ser&aacute;s capaz de conocer todo lo que se hace en tu empresa... y lo innecesario que es la mitad de ello. S&oacute;lo t&uacute; te atrever&aacute;s a luchar contra el m&aacute;s temible de los enemigos: <em>la costumbre</em>. S&oacute;lo t&uacute; tendr&aacute;s la osad&iacute;a de enmendarle la plana al jefe. S&oacute;lo t&uacute; ser&aacute;s capaz de resolver un problema que lleva lustros resolvi&eacute;ndose solo, pero claro, sin ordenadores. S&oacute;lo t&uacute; utilizar&aacute;s una inquietante frase: <em>&iquest;..esto, porqu&eacute; se hace as&iacute;..?</em> S&oacute;lo t&uacute; ser&aacute;s el m&aacute;s productivo para tu empresa (por eso te aguantan).  &nbsp; Si sobrevives a todo esto y alguna cosilla m&aacute;s, no lo dudes: eres programador de gesti&oacute;n.
<p>
<b>&iquest;Qu&eacute; es la gesti&oacute;n en internet?</b>
<p>
Si a todo lo anteriormente dicho a&ntilde;adimos algunos factores en el lado del cliente, tales como:
<ul>
   <li>Los problemas propios de la red (velocidad de caracol, cortes inesperados, etc.)
   <li>Las penosas condiciones en que se encuentra la m&aacute;quina del cliente: modelos jur&aacute;sicos, poca memoria, modem de esos que ya no hay,  toneladas de programas basura instalados, sistema operativo inesperado (o inoperante), etc.
   <li>El no saber que navegador utiliza (si es que sabe que hay que utilizar uno).
   <li>Que en general, el cliente, no sabe lo que est&aacute; haciendo, ni le importa gran cosa como termine todo, aunque eso s&iacute;, se apresurar&aacute; a decir que el problema reside en la aplicaci&oacute;n, jam&aacute;s en su m&aacute;quina, o en su escasa habilidad.
   <li>El que puede ser un "manitas inform&aacute;tico" (ante esto no hay salvaci&oacute;n posible) que se ha le&iacute;do todos los fasc&iacute;culos que anuncian por televisi&oacute;n.
   <li>El hecho constatado de que los usuarios no leen instrucciones, ni nada; se dejan llevar por un extra&ntilde;o instinto que casi siempre falla, lo que les obliga a probarlo todo (en el orden menos conveniente, por supuesto), y a ver que pasa....
   <li>El no saber si el cliente tiene impresora (y mucho menos c&oacute;mo se usa).
   <li>Que no tiene ni la m&aacute;s remota idea de lo que es capaz de hacer su ordenador, en general, y el navegador en particular: &iquest;para qu&eacute; sirve el bot&oacute;n derecho?, &iquest;d&oacute;nde est&aacute; la l&iacute;nea de estado?, &iquest;cual es la ventana de URL?, &iquest;men&uacute; de qu&eacute;...?
   <li>Que la configuraci&oacute;n de su m&aacute;quina nunca ser&aacute; la que tu esperas (por lo que no debes esperar ninguna).
   <li>Que aunque el cliente y t&uacute; hableis, te&oacute;ricamente, el mismo idioma, en la pr&aacute;ctica parecer&aacute; que uno de los dos es de otro planeta.
   <li>Etc., etc.
</ul>
Y algunos otros en nuestro propio lado:
<ul>
   <li>Que te van a exigir que tu aplicaci&oacute;n sea "atractiva" (pero que se cargue r&aacute;pida, faltaria m&aacute;s).
   <li>Que la gesti&oacute;n interna de nuestra empresa, en s&iacute; misma, es mala, y por tanto dif&iacute;cilmente mecanizable.
   <li>Que nuestro servidor va un poco "escaso de fuerzas".
   <li>Que existen los "hackers" (como los piratas de las pel&iacute;culas pero sin pata de palo) y los virus.
   <li>Que hay que garantizar la confidencialidad de los datos del cliente en muchos casos (casi todos).
   <li>Que la direcci&oacute;n de nuestro servidor no empieza por WWW (parece broma, pero ya ver&aacute;s el tiempo que pierdes por esto).
   <li>Que como nadie entiende tu aplicaci&oacute;n, nadie en la empresa es capaz de informar correctamente sobre ella a los clientes (... pero c&oacute;mo... &iquest;que t&uacute; no est&aacute;s para eso? &nbsp; &iexcl;&iexcl;...pues no lo entiendo, oye...!! &nbsp;&nbsp;-en realidad no es que no entienda eso, es que no entiende nada-).
   <li>Que los dias s&oacute;lo tienen 24 horas...
   <li>Etc., etc.
</ul> 
Se agita todo con precauci&oacute;n y el resultado es: <b>gesti&oacute;n en internet</b>
<p>



<hr>
<center>
<h3>
[<a href="../indice.htm">Indice</a>]
</h3>
</center>

</body>
</html>


