<HTML>
<HEAD><TITLE>ASP 5</TITLE>
</HEAD>

<BODY>

<center>
<h3>
[<a href="../indice.htm">Indice</a>]
</h3>
</center>
<hr>
<H2>Los elementos b&aacute;sicos del ASP</H2>

ASP en s&iacute; mismo proporciona siete elementos llamados <b>objetos</b>. Estos elementos, a un nivel sencillo, podemos considerarlos como unas herramientas, m&aacute;s o menos complicadas de manejar en funci&oacute;n de su utilidad. Cada una est&aacute; dise&ntilde;ada para unas funciones concretas, y para llegar a todas sus funcionalidades habr&aacute; que echar mano de otros sub elementos tales como: <b>m&eacute;todos, propiedades, colecciones</b> y <b>eventos</b>.. S&iacute;, me lo tem&iacute;a.... esto no est&aacute; muy claro... A ver as&iacute;: 

<h3>Un rato de bricolage</h3>

Bien, imagina que tienes entre las manos un fastuoso caj&oacute;n de herramientas que te regalaron por tu cumplea&ntilde;os. Es magn&iacute;fico, tiene de todo: taladro, lijadora, destornilladores, llaves inglesas, martillo....  es decir, tiene un mont&oacute;n de <b>objetos</b>. Y tenemos una tarea que realizar: colgar un cuadro de la pared. Esta ser&aacute; tu <b>sesi&oacute;n</b> de trabajo.
<p>
Piensa c&oacute;mo vas a colgar el cuadro. &iquest;Clavas un clavo en la pared y listos, o haces un agujero y le pones  un taco?  Est&aacute;s eligiendo un <b>m&eacute;todo</b>. Como el cuadro pesa bastante, te decides por el m&eacute;todo del taco.
<p>
Evidentemente,  hay que elegir la herramienta adecuada. F&aacute;cil: necesitas el taladro. Acabas de elegir un <b>objeto</b>. Tu taladro tiene dos <b>propiedades</b>: percutor para taladrar la pared, o sin percutor para taladrar otras cosas.
<p>
Haces el agujero en la pared. Intentas meter el taco en el agujero... y como Murphy no pod&iacute;a faltar a la cita, no cabe. Hay que hacer el agujero m&aacute;s grande. Para ello tienes que cambiar la broca, en suma, est&aacute;s haciendo uso de la <b>colecci&oacute;n</b> de brocas que tienes para el <b>objeto</b> taladro.
<p>
Mientras agrandas el agujero, suena el timbre de la puerta. Acaba de ocurrir un <b>evento</b>: con tanto ruido has despertado a tu vecino... y viene a agradec&eacute;rtelo.
<p>
&iquest;M&aacute;s claro ahora? Entonces veamos los famosos <b>objetos</b>, aunque debes tener claro que posiblemente, algunos de ellos o sus propiedades y colecciones, no los utilizar&aacute;s nunca aunque esten ah&iacute;. No es buena idea escribir programas intentando modificar o utilizar todo aquello que sea modificable o utilizable, por el simple hecho de impresionar con tu sabidur&iacute;a al cliente o justificar unas horas de trabajo adicionales, tarde o temprano, eso se volver&aacute; en tu contra... no olvides que Murphy no se toma vacaciones. Lo sencillo siempre funciona mejor que lo complicado, y si una cosa es simple, pues mucho mejor que si no lo es. No pierdas el tiempo complicando lo que no es complicado.
<p>
<h3>Los objetos de ASP</h3>
Existen siete objetos en ASP:
<font color="blue" size=4>
<UL>
<LI><a href="asp6.htm">Application</a>
<LI><a href="asp7.htm">ASPError</a>
<LI><a href="asp8.htm">Session </a>
<LI><a href="asp9.htm">Request</a>
<LI><a href="asp10.htm">Response</a>
<LI><a href="asp11.htm">Server </a>
<LI><a href="asp12.htm">ObjectConte</a>xt
</UL>
</font>

<hr>
<center>
<h3>
[<a href="../indice.htm">Indice</a>]
</h3>
</center>
<hr>

</BODY>
</HTML>
