<html>
<head>
<title>VBScript 9 </title>
</head>

<body>
<center>
<h3>
[<a href="../indice.htm">Indice</a>]
</h3>
</center>
<hr>

<H2> Visual Basic Script en el Internet Explorer de Microsoft</H2>
<h3>Aunque se parece, esto no es ASP</h3>

Hasta aqu&iacute; hemos visto en qu&eacute; consiste el VBscritpt que se utiliza en las p&aacute;ginas ASP. Este lenguaje no solamente puede utilizarse en p&aacute;ginas que se ejecutan en el servidor, como son las ASP, sino que tambi&eacute;n puede emplearse, al igual que el conocido  JavaScript (Microsoft tiene una versi&oacute;n propia llamada JScript), en el propio navegador. Todos los comandos, instrucciones y funciones descritas hasta ahora, pueden utilizarse en los scripts escritos para el navegador. 
<p>
El VBscript solamente puedes utilizarlo en p&aacute;ginas que vayan a ser visitadas con el <b>I</b>nternet <b>E</b>xplorer (en lo sucesivo <b>IE</b>) de Microsoft. Con otros navegadores nada de esto funcionar&aacute;, y se limitar&aacute;n a intepretar el c&oacute;digo HTML y los scripts escritos en  JavaScript si los hay, que s&iacute; son compatibles con todos los navegadores. Esta es la gran diferencia entre el ASP y los scripts de navegador. En resumen, para el IE puedes escribir p&aacute;ginas con HTML, XHTML, VBScript, JScript y JavaScript, pero recuerda que solamente son compatibles con el resto de navegadores el HTML, XHTML y JavaScript.
<p>
Los programas que se ejecutan en el IE no son capaces de hacer todo lo que se puede hacer con ASP, quedando reducido su &aacute;mbito de funcionamiento al entorno definido por el propio navegador. Esto es debido a que en el IE no estan disponibles los mismos objetos que en ASP, que solo funcionan en el servidor, pero a cambio se pueden utilizar otros objetos, con sus propiedades, m&eacute;todos y eventos, aportados por el propio IE.
<p>
El IE es un navegador que forma parte de los sistemas operativos Windows de Microsoft. Esto le permite conectar pr&aacute;cticamente con cualquier recurso del sistema, y por tanto, adoptar interfaces muy diferentes a las t&iacute;picas que puedan obtenerse solo con el HTML est&aacute;ndard.  Puede utilizarse, m&aacute;s que como un navegador, como una ventana de ejecuci&oacute;n de aplicaciones escritas con HTML y VBScript. Una primera aproximaci&oacute;n a esas interfaces nos la dan dos funcines que no existen en ASP: <font color="red">InputBox()</font> y <font color="red">MsgBox()</font>, que veremos m&aacute;s adelante c&oacute;mo se utilizan. Pueden también crearse p&aacute;ginas que faciliten ayuda contextual basada en ficheros <b>.hlp</b> t&iacute;picos de Windows y muchas utilidades m&aacute;s. Y por supuesto, pueden escribirse p&aacute;ginas tanto <b>.asp</b> como <b>.htm</b> que contengan scripts de navegador combinados, que permitir&aacute;n una mayor interactividad con el usuario.
<p>
Otra de las diferencias que encontraremos en los scripts del IE, es el alcance de los procedimientos y funciones. En efecto, en ASP los procedimientos <b>Sub</b> y <b>Function</b> pueden definirse como p&uacute;blicos o privados, seg&uacute;n deban ser utilizados en una misma secuencia de comandos o en otras. En el entorno de ejecuci&oacute;n del IE esto no es posible, y cualquier procedimiento definido es ejecutado una &uacute;nica vez en el momento de cargar la p&aacute;gina. Al cargar otra p&aacute;gina, o al recargar la misma, todos los valores o instrucciones manejados se pierden, inicializ&aacute;ndose todas las variables. Esto no significa que no puedan pasarse valores de una p&aacute;gina a otra, pero deber&aacute; hacerse con otras t&eacute;cnicas diferentes a las empleadas en ASP.
<p>









<hr>
<center>
<h3>
[<a href="../indice.htm">Indice</a>]
</h3>
</center>

</body>
</html>
