<html>
<head>
<title>VBScript 18 </title>
</head>

<body>
<center>
<h3>
[<a href="../indice.htm">Indice</a>]
</h3>
</center>
<hr>


<h3>Eventos del navegador</h3>

Los eventos se pueden asociar a una imagen, un formulario, un enlace, cadena de texto, o cualquier otro objeto de la p&aacute;gina. Puede que no todos funcionen en todos los navegadores. Como siempre, hay que probar cuantos m&aacute;s mejor. Veamos los m&aacute;s usuales atendiendo a d&oacute;nde se producen.
<p>
<h4>Eventos de rat&oacute;n</h4>

<b>onClick</b> &nbsp; Se activa al pulsar cualquier bot&oacute;n del rat&oacute;n.<br>
<b>onDblClick</b> &nbsp; Se activa si se hace un doble click.<br>
<b>onMouseDown</b>	&nbsp; Se activa si se pulsa el bot&oacute;n izquierdo del mouse.<br>
<b>onMouseMove</b> &nbsp; Se activa si se mueve el mouse.<br>
<b>onMouseOver</b> &nbsp; Se activa cuando el puntero se sit&uacute;a sobre el objeto (cualquiera) que incluye al evento.<br>
<b>onMouseOut</b> &nbsp; Se activa cuando el puntero sale del objeto que incluye al evento.<br>
<b>onMouseUp</b> &nbsp; Se activa si se suelta un bot&oacute;n pulsado en el mouse (lo  contrario de onClick).<br>
<b>onDragStart</b> &nbsp; Se activa cuando se inicia un arrastre.<br>
<b>onSelectStart</b> &nbsp; Se activa cuando se inicia una selecci&oacute;n con el rat&oacute;n.<br>
<b>onSelect</b> &nbsp; Se activa cuando ya se ha realizado una selecci&oacute;n con el rat&oacute;n.<br>
<p>
<h4>Eventos de teclado</h4>
<b>onKeyDown</b> &nbsp; Se activa si se pulsa una tecla cualquiera.<br>
<b>onKeyPress</b> &nbsp; Se activa si se pulsa y suelta una tecla.<br>
<b>onKeyUp</b> &nbsp; Se activa cuando se suelta una tecla pulsada.<br>
<b>onHelp</b> &nbsp;  Se activa si se pulsa la tecla de ayuda (normalmente F1).<br>
<p>
<h4>Eventos de enfoque</h4>
<b>onFocus</b> &nbsp; Se activa cuando se entra en el &aacute;mbito de un elemento al que est&aacute; asociado el evento. Generalmente elementos de un formulario<br>
<b>onBlur</b> &nbsp; Se activa al abandonar el &aacute;mbito del elemento al que est&aacute; asociado (lo contrario de onFocus).<br>
<p>
<h4>Eventos de formulario</h4>
<b>onReset</b> &nbsp; Se activa al pulsar un bot&oacute;n de reset de un formulario.<br>
<b>onSubmit</b> &nbsp; Se activa al enviar un formulario.<br>
<p>
<h4>Eventos de carga de p&aacute;gina</h4>
<b>onAbort</b> &nbsp; Se activa cuando se aborta la carga de la p&aacute;gina.<br>
<b>onError</b> &nbsp; Se activa cuando se produce un error inesperado durante la carga de la p&aacute;gina.<br>
<b>onLoad</b> &nbsp; Se activa cuando se carga la p&aacute;gina completa.<br>
<b>onUnload</b> &nbsp; Se activa cuando el usuario descarga la p&aacute;gina, es decir, cuando carga otra o pretende salir del navegador.<br>
<b>onAfterUpdate</b> &nbsp; Se activa si se actualiza o recarga la p&aacute;gina. <br>

<hr>
<center>
<h3>
[<a href="../indice.htm">Indice</a>]
</h3>
</center>

</body>
</html>
